app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
---
    def set_user
      if !params[:id].nil?
        @user = User.find(params[:id])