app/controllers/workrows_controller.rb

SELECT "workrows".* FROM "workrows" WHERE "workrows"."user_id" = ?  [["user_id", 5]]
---
  def index
    @workrows = current_user.workrows.all

INSERT INTO "workrows" ("task", "hours_worked", "notes", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["task", "toptal"], ["hours_worked", 6.0], ["notes", "learning rails"], ["date", "2015-07-10"], ["created_at", "2015-07-10 22:41:11.916293"], ["updated_at", "2015-07-10 22:41:11.916293"]]
---
  def create
    @workrow = current_user.workrows.new(workrow_params)

    respond_to do |format|
      if @workrow.save

SELECT  "workrows".* FROM "workrows" WHERE "workrows"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_workrow
      @workrow = current_user.workrows.find(params[:id])